GopalSaraf/Practicals/PSDL/include/proc/pic18f57q43.h
extern volatile U4CON1bits_t U4CON1bits __at(0x2E5);
// bitfield macros
#define _U4CON1_SENDB_POSN                                  0x0
#define _U4CON1_SENDB_POSITION                              0x0
#define _U4CON1_SENDB_SIZE                                  0x1
#define _U4CON1_SENDB_LENGTH                                0x1
#define _U4CON1_SENDB_MASK                                  0x1
#define _U4CON1_BRKOVR_POSN                                 0x1
#define _U4CON1_BRKOVR_POSITION                             0x1
#define _U4CON1_BRKOVR_SIZE                                 0x1
#define _U4CON1_BRKOVR_LENGTH                               0x1
#define _U4CON1_BRKOVR_MASK                                 0x2
#define _U4CON1_RXBIMD_POSN                                 0x3
#define _U4CON1_RXBIMD_POSITION                             0x3
#define _U4CON1_RXBIMD_SIZE                                 0x1
#define _U4CON1_RXBIMD_LENGTH                               0x1
#define _U4CON1_RXBIMD_MASK                                 0x8
#define _U4CON1_WUE_POSN                                    0x4
#define _U4CON1_WUE_POSITION                                0x4
#define _U4CON1_WUE_SIZE                                    0x1
#define _U4CON1_WUE_LENGTH                                  0x1
#define _U4CON1_WUE_MASK                                    0x10
#define _U4CON1_ON_POSN                                     0x7
#define _U4CON1_ON_POSITION                                 0x7
#define _U4CON1_ON_SIZE                                     0x1
#define _U4CON1_ON_LENGTH                                   0x1
#define _U4CON1_ON_MASK                                     0x80
#define _U4CON1_U4SENDB_POSN                                0x0
#define _U4CON1_U4SENDB_POSITION                            0x0
#define _U4CON1_U4SENDB_SIZE                                0x1
#define _U4CON1_U4SENDB_LENGTH                              0x1
#define _U4CON1_U4SENDB_MASK                                0x1
#define _U4CON1_U4BRKOVR_POSN                               0x1
#define _U4CON1_U4BRKOVR_POSITION                           0x1
#define _U4CON1_U4BRKOVR_SIZE                               0x1
#define _U4CON1_U4BRKOVR_LENGTH                             0x1
#define _U4CON1_U4BRKOVR_MASK                               0x2
#define _U4CON1_U4RXBIMD_POSN                               0x3
#define _U4CON1_U4RXBIMD_POSITION                           0x3
#define _U4CON1_U4RXBIMD_SIZE                               0x1
#define _U4CON1_U4RXBIMD_LENGTH                             0x1
#define _U4CON1_U4RXBIMD_MASK                               0x8
#define _U4CON1_U4WUE_POSN                                  0x4
#define _U4CON1_U4WUE_POSITION                              0x4
#define _U4CON1_U4WUE_SIZE                                  0x1
#define _U4CON1_U4WUE_LENGTH                                0x1
#define _U4CON1_U4WUE_MASK                                  0x10
#define _U4CON1_U4ON_POSN                                   0x7
#define _U4CON1_U4ON_POSITION                               0x7
#define _U4CON1_U4ON_SIZE                                   0x1
#define _U4CON1_U4ON_LENGTH                                 0x1
#define _U4CON1_U4ON_MASK                                   0x80

// Register: U4CON2
#define U4CON2 U4CON2
extern volatile unsigned char           U4CON2              __at(0x2E6);
#ifndef _LIB_BUILD
asm("U4CON2 equ 02E6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned                        :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U4FLO                  :2;
        unsigned U4TXPOL                :1;
        unsigned                        :1;
        unsigned U4STP                  :2;
        unsigned U4RXPOL                :1;
        unsigned U4RUNOVF               :1;
    };
    struct {
        unsigned U4FLO0                 :1;
        unsigned U4FLO1                 :1;
        unsigned                        :2;
        unsigned U4STP0                 :1;
        unsigned U4STP1                 :1;
    };
} U4CON2bits_t;
extern volatile U4CON2bits_t U4CON2bits __at(0x2E6);
// bitfield macros
#define _U4CON2_FLO_POSN                                    0x0
#define _U4CON2_FLO_POSITION                                0x0
#define _U4CON2_FLO_SIZE                                    0x2
#define _U4CON2_FLO_LENGTH                                  0x2
#define _U4CON2_FLO_MASK                                    0x3
#define _U4CON2_TXPOL_POSN                                  0x2
#define _U4CON2_TXPOL_POSITION                              0x2
#define _U4CON2_TXPOL_SIZE                                  0x1
#define _U4CON2_TXPOL_LENGTH                                0x1
#define _U4CON2_TXPOL_MASK                                  0x4
#define _U4CON2_STP_POSN                                    0x4
#define _U4CON2_STP_POSITION                                0x4
#define _U4CON2_STP_SIZE                                    0x2
#define _U4CON2_STP_LENGTH                                  0x2
#define _U4CON2_STP_MASK                                    0x30
#define _U4CON2_RXPOL_POSN                                  0x6
#define _U4CON2_RXPOL_POSITION                              0x6
#define _U4CON2_RXPOL_SIZE                                  0x1
#define _U4CON2_RXPOL_LENGTH                                0x1
#define _U4CON2_RXPOL_MASK                                  0x40
#define _U4CON2_RUNOVF_POSN                                 0x7
#define _U4CON2_RUNOVF_POSITION                             0x7
#define _U4CON2_RUNOVF_SIZE                                 0x1
#define _U4CON2_RUNOVF_LENGTH                               0x1
#define _U4CON2_RUNOVF_MASK                                 0x80
#define _U4CON2_FLO0_POSN                                   0x0
#define _U4CON2_FLO0_POSITION                               0x0
#define _U4CON2_FLO0_SIZE                                   0x1
#define _U4CON2_FLO0_LENGTH                                 0x1
#define _U4CON2_FLO0_MASK                                   0x1
#define _U4CON2_FLO1_POSN                                   0x1
#define _U4CON2_FLO1_POSITION                               0x1
#define _U4CON2_FLO1_SIZE                                   0x1
#define _U4CON2_FLO1_LENGTH                                 0x1
#define _U4CON2_FLO1_MASK                                   0x2
#define _U4CON2_STP0_POSN                                   0x4
#define _U4CON2_STP0_POSITION                               0x4
#define _U4CON2_STP0_SIZE                                   0x1
#define _U4CON2_STP0_LENGTH                                 0x1
#define _U4CON2_STP0_MASK                                   0x10
#define _U4CON2_STP1_POSN                                   0x5
#define _U4CON2_STP1_POSITION                               0x5
#define _U4CON2_STP1_SIZE                                   0x1
#define _U4CON2_STP1_LENGTH                                 0x1
#define _U4CON2_STP1_MASK                                   0x20
#define _U4CON2_U4FLO_POSN                                  0x0
#define _U4CON2_U4FLO_POSITION                              0x0
#define _U4CON2_U4FLO_SIZE                                  0x2
#define _U4CON2_U4FLO_LENGTH                                0x2
#define _U4CON2_U4FLO_MASK                                  0x3
#define _U4CON2_U4TXPOL_POSN                                0x2
#define _U4CON2_U4TXPOL_POSITION                            0x2
#define _U4CON2_U4TXPOL_SIZE                                0x1
#define _U4CON2_U4TXPOL_LENGTH                              0x1
#define _U4CON2_U4TXPOL_MASK                                0x4
#define _U4CON2_U4STP_POSN                                  0x4
#define _U4CON2_U4STP_POSITION                              0x4
#define _U4CON2_U4STP_SIZE                                  0x2
#define _U4CON2_U4STP_LENGTH                                0x2
#define _U4CON2_U4STP_MASK                                  0x30
#define _U4CON2_U4RXPOL_POSN                                0x6
#define _U4CON2_U4RXPOL_POSITION                            0x6
#define _U4CON2_U4RXPOL_SIZE                                0x1
#define _U4CON2_U4RXPOL_LENGTH                              0x1
#define _U4CON2_U4RXPOL_MASK                                0x40
#define _U4CON2_U4RUNOVF_POSN                               0x7
#define _U4CON2_U4RUNOVF_POSITION                           0x7
#define _U4CON2_U4RUNOVF_SIZE                               0x1
#define _U4CON2_U4RUNOVF_LENGTH                             0x1
#define _U4CON2_U4RUNOVF_MASK                               0x80
#define _U4CON2_U4FLO0_POSN                                 0x0
#define _U4CON2_U4FLO0_POSITION                             0x0
#define _U4CON2_U4FLO0_SIZE                                 0x1
#define _U4CON2_U4FLO0_LENGTH                               0x1
#define _U4CON2_U4FLO0_MASK                                 0x1
#define _U4CON2_U4FLO1_POSN                                 0x1
#define _U4CON2_U4FLO1_POSITION                             0x1
#define _U4CON2_U4FLO1_SIZE                                 0x1
#define _U4CON2_U4FLO1_LENGTH                               0x1
#define _U4CON2_U4FLO1_MASK                                 0x2
#define _U4CON2_U4STP0_POSN                                 0x4
#define _U4CON2_U4STP0_POSITION                             0x4
#define _U4CON2_U4STP0_SIZE                                 0x1
#define _U4CON2_U4STP0_LENGTH                               0x1
#define _U4CON2_U4STP0_MASK                                 0x10
#define _U4CON2_U4STP1_POSN                                 0x5
#define _U4CON2_U4STP1_POSITION                             0x5
#define _U4CON2_U4STP1_SIZE                                 0x1
#define _U4CON2_U4STP1_LENGTH                               0x1
#define _U4CON2_U4STP1_MASK                                 0x20

// Register: U4BRG
#define U4BRG U4BRG
extern volatile unsigned short          U4BRG               __at(0x2E7);
#ifndef _LIB_BUILD
asm("U4BRG equ 02E7h");
#endif

// Register: U4BRGL
#define U4BRGL U4BRGL
extern volatile unsigned char           U4BRGL              __at(0x2E7);
#ifndef _LIB_BUILD
asm("U4BRGL equ 02E7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U4BRGLbits_t;
