GopalSaraf/Practicals/PSDL/include/proc/pic18f57q43.h
// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0x366);
#ifndef _LIB_BUILD
asm("IPR4 equ 0366h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIP                 :1;
        unsigned U1TXIP                 :1;
        unsigned U1EIP                  :1;
        unsigned U1IP                   :1;
        unsigned                        :2;
        unsigned PWM1PIP                :1;
        unsigned PWM1IP                 :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0x366);
// bitfield macros
#define _IPR4_U1RXIP_POSN                                   0x0
#define _IPR4_U1RXIP_POSITION                               0x0
#define _IPR4_U1RXIP_SIZE                                   0x1
#define _IPR4_U1RXIP_LENGTH                                 0x1
#define _IPR4_U1RXIP_MASK                                   0x1
#define _IPR4_U1TXIP_POSN                                   0x1
#define _IPR4_U1TXIP_POSITION                               0x1
#define _IPR4_U1TXIP_SIZE                                   0x1
#define _IPR4_U1TXIP_LENGTH                                 0x1
#define _IPR4_U1TXIP_MASK                                   0x2
#define _IPR4_U1EIP_POSN                                    0x2
#define _IPR4_U1EIP_POSITION                                0x2
#define _IPR4_U1EIP_SIZE                                    0x1
#define _IPR4_U1EIP_LENGTH                                  0x1
#define _IPR4_U1EIP_MASK                                    0x4
#define _IPR4_U1IP_POSN                                     0x3
#define _IPR4_U1IP_POSITION                                 0x3
#define _IPR4_U1IP_SIZE                                     0x1
#define _IPR4_U1IP_LENGTH                                   0x1
#define _IPR4_U1IP_MASK                                     0x8
#define _IPR4_PWM1PIP_POSN                                  0x6
#define _IPR4_PWM1PIP_POSITION                              0x6
#define _IPR4_PWM1PIP_SIZE                                  0x1
#define _IPR4_PWM1PIP_LENGTH                                0x1
#define _IPR4_PWM1PIP_MASK                                  0x40
#define _IPR4_PWM1IP_POSN                                   0x7
#define _IPR4_PWM1IP_POSITION                               0x7
#define _IPR4_PWM1IP_SIZE                                   0x1
#define _IPR4_PWM1IP_LENGTH                                 0x1
#define _IPR4_PWM1IP_MASK                                   0x80

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0x367);
#ifndef _LIB_BUILD
asm("IPR5 equ 0367h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI2RXIP               :1;
        unsigned SPI2TXIP               :1;
        unsigned SPI2IP                 :1;
        unsigned                        :1;
        unsigned TMR3IP                 :1;
        unsigned TMR3GIP                :1;
        unsigned PWM2PIP                :1;
        unsigned PWM2IP                 :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0x367);
// bitfield macros
#define _IPR5_SPI2RXIP_POSN                                 0x0
#define _IPR5_SPI2RXIP_POSITION                             0x0
#define _IPR5_SPI2RXIP_SIZE                                 0x1
#define _IPR5_SPI2RXIP_LENGTH                               0x1
#define _IPR5_SPI2RXIP_MASK                                 0x1
#define _IPR5_SPI2TXIP_POSN                                 0x1
#define _IPR5_SPI2TXIP_POSITION                             0x1
#define _IPR5_SPI2TXIP_SIZE                                 0x1
#define _IPR5_SPI2TXIP_LENGTH                               0x1
#define _IPR5_SPI2TXIP_MASK                                 0x2
#define _IPR5_SPI2IP_POSN                                   0x2
#define _IPR5_SPI2IP_POSITION                               0x2
#define _IPR5_SPI2IP_SIZE                                   0x1
#define _IPR5_SPI2IP_LENGTH                                 0x1
#define _IPR5_SPI2IP_MASK                                   0x4
#define _IPR5_TMR3IP_POSN                                   0x4
#define _IPR5_TMR3IP_POSITION                               0x4
#define _IPR5_TMR3IP_SIZE                                   0x1
#define _IPR5_TMR3IP_LENGTH                                 0x1
#define _IPR5_TMR3IP_MASK                                   0x10
#define _IPR5_TMR3GIP_POSN                                  0x5
#define _IPR5_TMR3GIP_POSITION                              0x5
#define _IPR5_TMR3GIP_SIZE                                  0x1
#define _IPR5_TMR3GIP_LENGTH                                0x1
#define _IPR5_TMR3GIP_MASK                                  0x20
#define _IPR5_PWM2PIP_POSN                                  0x6
#define _IPR5_PWM2PIP_POSITION                              0x6
#define _IPR5_PWM2PIP_SIZE                                  0x1
#define _IPR5_PWM2PIP_LENGTH                                0x1
#define _IPR5_PWM2PIP_MASK                                  0x40
#define _IPR5_PWM2IP_POSN                                   0x7
#define _IPR5_PWM2IP_POSITION                               0x7
#define _IPR5_PWM2IP_SIZE                                   0x1
#define _IPR5_PWM2IP_LENGTH                                 0x1
#define _IPR5_PWM2IP_MASK                                   0x80

// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0x368);
#ifndef _LIB_BUILD
asm("IPR6 equ 0368h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IP                 :1;
        unsigned CLC2IP                 :1;
        unsigned CWG1IP                 :1;
        unsigned NCO1IP                 :1;
        unsigned DMA2SCNTIP             :1;
        unsigned DMA2DCNTIP             :1;
        unsigned DMA2ORIP               :1;
        unsigned DMA2AIP                :1;
    };
} IPR6bits_t;
