GopalSaraf/Practicals/PSDL/include/proc/pic18f57q43.h
extern volatile IPR10bits_t IPR10bits __at(0x36C);
// bitfield macros
#define _IPR10_INT2IP_POSN                                  0x0
#define _IPR10_INT2IP_POSITION                              0x0
#define _IPR10_INT2IP_SIZE                                  0x1
#define _IPR10_INT2IP_LENGTH                                0x1
#define _IPR10_INT2IP_MASK                                  0x1
#define _IPR10_CLC5IP_POSN                                  0x1
#define _IPR10_CLC5IP_POSITION                              0x1
#define _IPR10_CLC5IP_SIZE                                  0x1
#define _IPR10_CLC5IP_LENGTH                                0x1
#define _IPR10_CLC5IP_MASK                                  0x2
#define _IPR10_CWG2IP_POSN                                  0x2
#define _IPR10_CWG2IP_POSITION                              0x2
#define _IPR10_CWG2IP_SIZE                                  0x1
#define _IPR10_CWG2IP_LENGTH                                0x1
#define _IPR10_CWG2IP_MASK                                  0x4
#define _IPR10_NCO2IP_POSN                                  0x3
#define _IPR10_NCO2IP_POSITION                              0x3
#define _IPR10_NCO2IP_SIZE                                  0x1
#define _IPR10_NCO2IP_LENGTH                                0x1
#define _IPR10_NCO2IP_MASK                                  0x8
#define _IPR10_DMA3SCNTIP_POSN                              0x4
#define _IPR10_DMA3SCNTIP_POSITION                          0x4
#define _IPR10_DMA3SCNTIP_SIZE                              0x1
#define _IPR10_DMA3SCNTIP_LENGTH                            0x1
#define _IPR10_DMA3SCNTIP_MASK                              0x10
#define _IPR10_DMA3DCNTIP_POSN                              0x5
#define _IPR10_DMA3DCNTIP_POSITION                          0x5
#define _IPR10_DMA3DCNTIP_SIZE                              0x1
#define _IPR10_DMA3DCNTIP_LENGTH                            0x1
#define _IPR10_DMA3DCNTIP_MASK                              0x20
#define _IPR10_DMA3ORIP_POSN                                0x6
#define _IPR10_DMA3ORIP_POSITION                            0x6
#define _IPR10_DMA3ORIP_SIZE                                0x1
#define _IPR10_DMA3ORIP_LENGTH                              0x1
#define _IPR10_DMA3ORIP_MASK                                0x40
#define _IPR10_DMA3AIP_POSN                                 0x7
#define _IPR10_DMA3AIP_POSITION                             0x7
#define _IPR10_DMA3AIP_SIZE                                 0x1
#define _IPR10_DMA3AIP_LENGTH                               0x1
#define _IPR10_DMA3AIP_MASK                                 0x80

// Register: IPR11
#define IPR11 IPR11
extern volatile unsigned char           IPR11               __at(0x36D);
#ifndef _LIB_BUILD
asm("IPR11 equ 036Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3IP                 :1;
        unsigned CLC6IP                 :1;
        unsigned CWG3IP                 :1;
        unsigned TMR4IP                 :1;
        unsigned DMA4SCNTIP             :1;
        unsigned DMA4DCNTIP             :1;
        unsigned DMA4ORIP               :1;
        unsigned DMA4AIP                :1;
    };
} IPR11bits_t;
extern volatile IPR11bits_t IPR11bits __at(0x36D);
// bitfield macros
#define _IPR11_CCP3IP_POSN                                  0x0
#define _IPR11_CCP3IP_POSITION                              0x0
#define _IPR11_CCP3IP_SIZE                                  0x1
#define _IPR11_CCP3IP_LENGTH                                0x1
#define _IPR11_CCP3IP_MASK                                  0x1
#define _IPR11_CLC6IP_POSN                                  0x1
#define _IPR11_CLC6IP_POSITION                              0x1
#define _IPR11_CLC6IP_SIZE                                  0x1
#define _IPR11_CLC6IP_LENGTH                                0x1
#define _IPR11_CLC6IP_MASK                                  0x2
#define _IPR11_CWG3IP_POSN                                  0x2
#define _IPR11_CWG3IP_POSITION                              0x2
#define _IPR11_CWG3IP_SIZE                                  0x1
#define _IPR11_CWG3IP_LENGTH                                0x1
#define _IPR11_CWG3IP_MASK                                  0x4
#define _IPR11_TMR4IP_POSN                                  0x3
#define _IPR11_TMR4IP_POSITION                              0x3
#define _IPR11_TMR4IP_SIZE                                  0x1
#define _IPR11_TMR4IP_LENGTH                                0x1
#define _IPR11_TMR4IP_MASK                                  0x8
#define _IPR11_DMA4SCNTIP_POSN                              0x4
#define _IPR11_DMA4SCNTIP_POSITION                          0x4
#define _IPR11_DMA4SCNTIP_SIZE                              0x1
#define _IPR11_DMA4SCNTIP_LENGTH                            0x1
#define _IPR11_DMA4SCNTIP_MASK                              0x10
#define _IPR11_DMA4DCNTIP_POSN                              0x5
#define _IPR11_DMA4DCNTIP_POSITION                          0x5
#define _IPR11_DMA4DCNTIP_SIZE                              0x1
#define _IPR11_DMA4DCNTIP_LENGTH                            0x1
#define _IPR11_DMA4DCNTIP_MASK                              0x20
#define _IPR11_DMA4ORIP_POSN                                0x6
#define _IPR11_DMA4ORIP_POSITION                            0x6
#define _IPR11_DMA4ORIP_SIZE                                0x1
#define _IPR11_DMA4ORIP_LENGTH                              0x1
#define _IPR11_DMA4ORIP_MASK                                0x40
#define _IPR11_DMA4AIP_POSN                                 0x7
#define _IPR11_DMA4AIP_POSITION                             0x7
#define _IPR11_DMA4AIP_SIZE                                 0x1
#define _IPR11_DMA4AIP_LENGTH                               0x1
#define _IPR11_DMA4AIP_MASK                                 0x80

// Register: IPR12
#define IPR12 IPR12
extern volatile unsigned char           IPR12               __at(0x36E);
#ifndef _LIB_BUILD
asm("IPR12 equ 036Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U4RXIP                 :1;
        unsigned U4TXIP                 :1;
        unsigned U4EIP                  :1;
        unsigned U4IP                   :1;
        unsigned DMA5SCNTIP             :1;
        unsigned DMA5DCNTIP             :1;
        unsigned DMA5ORIP               :1;
        unsigned DMA5AIP                :1;
    };
} IPR12bits_t;
extern volatile IPR12bits_t IPR12bits __at(0x36E);
// bitfield macros
#define _IPR12_U4RXIP_POSN                                  0x0
#define _IPR12_U4RXIP_POSITION                              0x0
#define _IPR12_U4RXIP_SIZE                                  0x1
#define _IPR12_U4RXIP_LENGTH                                0x1
#define _IPR12_U4RXIP_MASK                                  0x1
#define _IPR12_U4TXIP_POSN                                  0x1
#define _IPR12_U4TXIP_POSITION                              0x1
#define _IPR12_U4TXIP_SIZE                                  0x1
#define _IPR12_U4TXIP_LENGTH                                0x1
#define _IPR12_U4TXIP_MASK                                  0x2
#define _IPR12_U4EIP_POSN                                   0x2
#define _IPR12_U4EIP_POSITION                               0x2
#define _IPR12_U4EIP_SIZE                                   0x1
#define _IPR12_U4EIP_LENGTH                                 0x1
#define _IPR12_U4EIP_MASK                                   0x4
#define _IPR12_U4IP_POSN                                    0x3
#define _IPR12_U4IP_POSITION                                0x3
#define _IPR12_U4IP_SIZE                                    0x1
#define _IPR12_U4IP_LENGTH                                  0x1
#define _IPR12_U4IP_MASK                                    0x8
#define _IPR12_DMA5SCNTIP_POSN                              0x4
#define _IPR12_DMA5SCNTIP_POSITION                          0x4
#define _IPR12_DMA5SCNTIP_SIZE                              0x1
#define _IPR12_DMA5SCNTIP_LENGTH                            0x1
#define _IPR12_DMA5SCNTIP_MASK                              0x10
#define _IPR12_DMA5DCNTIP_POSN                              0x5
#define _IPR12_DMA5DCNTIP_POSITION                          0x5
#define _IPR12_DMA5DCNTIP_SIZE                              0x1
#define _IPR12_DMA5DCNTIP_LENGTH                            0x1
#define _IPR12_DMA5DCNTIP_MASK                              0x20
#define _IPR12_DMA5ORIP_POSN                                0x6
#define _IPR12_DMA5ORIP_POSITION                            0x6
#define _IPR12_DMA5ORIP_SIZE                                0x1
#define _IPR12_DMA5ORIP_LENGTH                              0x1
#define _IPR12_DMA5ORIP_MASK                                0x40
#define _IPR12_DMA5AIP_POSN                                 0x7
#define _IPR12_DMA5AIP_POSITION                             0x7
#define _IPR12_DMA5AIP_SIZE                                 0x1
#define _IPR12_DMA5AIP_LENGTH                               0x1
#define _IPR12_DMA5AIP_MASK                                 0x80

// Register: IPR13
#define IPR13 IPR13
extern volatile unsigned char           IPR13               __at(0x36F);
#ifndef _LIB_BUILD
asm("IPR13 equ 036Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U5RXIP                 :1;
        unsigned U5TXIP                 :1;
        unsigned U5EIP                  :1;
        unsigned U5IP                   :1;
        unsigned DMA6SCNTIP             :1;
        unsigned DMA6DCNTIP             :1;
        unsigned DMA6ORIP               :1;
        unsigned DMA6AIP                :1;
    };
} IPR13bits_t;
extern volatile IPR13bits_t IPR13bits __at(0x36F);
// bitfield macros
#define _IPR13_U5RXIP_POSN                                  0x0
#define _IPR13_U5RXIP_POSITION                              0x0
#define _IPR13_U5RXIP_SIZE                                  0x1
#define _IPR13_U5RXIP_LENGTH                                0x1
#define _IPR13_U5RXIP_MASK                                  0x1
#define _IPR13_U5TXIP_POSN                                  0x1
#define _IPR13_U5TXIP_POSITION                              0x1
#define _IPR13_U5TXIP_SIZE                                  0x1
#define _IPR13_U5TXIP_LENGTH                                0x1
#define _IPR13_U5TXIP_MASK                                  0x2
#define _IPR13_U5EIP_POSN                                   0x2
#define _IPR13_U5EIP_POSITION                               0x2
#define _IPR13_U5EIP_SIZE                                   0x1
#define _IPR13_U5EIP_LENGTH                                 0x1
#define _IPR13_U5EIP_MASK                                   0x4
#define _IPR13_U5IP_POSN                                    0x3
#define _IPR13_U5IP_POSITION                                0x3
#define _IPR13_U5IP_SIZE                                    0x1
#define _IPR13_U5IP_LENGTH                                  0x1
#define _IPR13_U5IP_MASK                                    0x8
#define _IPR13_DMA6SCNTIP_POSN                              0x4
#define _IPR13_DMA6SCNTIP_POSITION                          0x4
#define _IPR13_DMA6SCNTIP_SIZE                              0x1
#define _IPR13_DMA6SCNTIP_LENGTH                            0x1
#define _IPR13_DMA6SCNTIP_MASK                              0x10
#define _IPR13_DMA6DCNTIP_POSN                              0x5
#define _IPR13_DMA6DCNTIP_POSITION                          0x5
#define _IPR13_DMA6DCNTIP_SIZE                              0x1
#define _IPR13_DMA6DCNTIP_LENGTH                            0x1
#define _IPR13_DMA6DCNTIP_MASK                              0x20
#define _IPR13_DMA6ORIP_POSN                                0x6
#define _IPR13_DMA6ORIP_POSITION                            0x6
#define _IPR13_DMA6ORIP_SIZE                                0x1
#define _IPR13_DMA6ORIP_LENGTH                              0x1
#define _IPR13_DMA6ORIP_MASK                                0x40
#define _IPR13_DMA6AIP_POSN                                 0x7
#define _IPR13_DMA6AIP_POSITION                             0x7
#define _IPR13_DMA6AIP_SIZE                                 0x1
#define _IPR13_DMA6AIP_LENGTH                               0x1
#define _IPR13_DMA6AIP_MASK                                 0x80

