GopalSaraf/Practicals/PSDL/include/proc/pic18f57q43.h
#define                                 U3RXBE_bit          _BIT_ACCESS(U3FIFO,1)
// U3FIFO<U3RXBF>
extern volatile __bit                   U3RXBF              __at(0x16B0);	// @ (0x2D6 * 8 + 0)
#define                                 U3RXBF_bit          _BIT_ACCESS(U3FIFO,0)
// U3CON1<U3RXBIMD>
extern volatile __bit                   U3RXBIMD            __at(0x1693);	// @ (0x2D2 * 8 + 3)
#define                                 U3RXBIMD_bit        _BIT_ACCESS(U3CON1,3)
// U3ERRIE<U3RXBKIE>
extern volatile __bit                   U3RXBKIE            __at(0x16CA);	// @ (0x2D9 * 8 + 2)
#define                                 U3RXBKIE_bit        _BIT_ACCESS(U3ERRIE,2)
// U3ERRIR<U3RXBKIF>
extern volatile __bit                   U3RXBKIF            __at(0x16C2);	// @ (0x2D8 * 8 + 2)
#define                                 U3RXBKIF_bit        _BIT_ACCESS(U3ERRIR,2)
// U3CON0<U3RXEN>
extern volatile __bit                   U3RXEN              __at(0x168C);	// @ (0x2D1 * 8 + 4)
#define                                 U3RXEN_bit          _BIT_ACCESS(U3CON0,4)
// U3ERRIE<U3RXFOIE>
extern volatile __bit                   U3RXFOIE            __at(0x16C9);	// @ (0x2D9 * 8 + 1)
#define                                 U3RXFOIE_bit        _BIT_ACCESS(U3ERRIE,1)
// U3ERRIR<U3RXFOIF>
extern volatile __bit                   U3RXFOIF            __at(0x16C1);	// @ (0x2D8 * 8 + 1)
#define                                 U3RXFOIF_bit        _BIT_ACCESS(U3ERRIR,1)
// U3FIFO<U3RXIDL>
extern volatile __bit                   U3RXIDL             __at(0x16B3);	// @ (0x2D6 * 8 + 3)
#define                                 U3RXIDL_bit         _BIT_ACCESS(U3FIFO,3)
// PIE9<U3RXIE>
extern volatile __bit                   U3RXIE              __at(0x2538);	// @ (0x4A7 * 8 + 0)
#define                                 U3RXIE_bit          _BIT_ACCESS(PIE9,0)
// PIR9<U3RXIF>
extern volatile __bit                   U3RXIF              __at(0x25B8);	// @ (0x4B7 * 8 + 0)
#define                                 U3RXIF_bit          _BIT_ACCESS(PIR9,0)
// IPR9<U3RXIP>
extern volatile __bit                   U3RXIP              __at(0x1B58);	// @ (0x36B * 8 + 0)
#define                                 U3RXIP_bit          _BIT_ACCESS(IPR9,0)
// U3CON2<U3RXPOL>
extern volatile __bit                   U3RXPOL             __at(0x169E);	// @ (0x2D3 * 8 + 6)
#define                                 U3RXPOL_bit         _BIT_ACCESS(U3CON2,6)
// U3RXPPS<U3RXPPS0>
extern volatile __bit                   U3RXPPS0            __at(0x13B0);	// @ (0x276 * 8 + 0)
#define                                 U3RXPPS0_bit        _BIT_ACCESS(U3RXPPS,0)
// U3RXPPS<U3RXPPS1>
extern volatile __bit                   U3RXPPS1            __at(0x13B1);	// @ (0x276 * 8 + 1)
#define                                 U3RXPPS1_bit        _BIT_ACCESS(U3RXPPS,1)
// U3RXPPS<U3RXPPS2>
extern volatile __bit                   U3RXPPS2            __at(0x13B2);	// @ (0x276 * 8 + 2)
#define                                 U3RXPPS2_bit        _BIT_ACCESS(U3RXPPS,2)
// U3RXPPS<U3RXPPS3>
extern volatile __bit                   U3RXPPS3            __at(0x13B3);	// @ (0x276 * 8 + 3)
#define                                 U3RXPPS3_bit        _BIT_ACCESS(U3RXPPS,3)
// U3RXPPS<U3RXPPS4>
extern volatile __bit                   U3RXPPS4            __at(0x13B4);	// @ (0x276 * 8 + 4)
#define                                 U3RXPPS4_bit        _BIT_ACCESS(U3RXPPS,4)
// U3RXPPS<U3RXPPS5>
extern volatile __bit                   U3RXPPS5            __at(0x13B5);	// @ (0x276 * 8 + 5)
#define                                 U3RXPPS5_bit        _BIT_ACCESS(U3RXPPS,5)
// U3CON1<U3SENDB>
extern volatile __bit                   U3SENDB             __at(0x1690);	// @ (0x2D2 * 8 + 0)
#define                                 U3SENDB_bit         _BIT_ACCESS(U3CON1,0)
// U3CON2<U3STP0>
extern volatile __bit                   U3STP0              __at(0x169C);	// @ (0x2D3 * 8 + 4)
#define                                 U3STP0_bit          _BIT_ACCESS(U3CON2,4)
// U3CON2<U3STP1>
extern volatile __bit                   U3STP1              __at(0x169D);	// @ (0x2D3 * 8 + 5)
#define                                 U3STP1_bit          _BIT_ACCESS(U3CON2,5)
// U3FIFO<U3STPMD>
extern volatile __bit                   U3STPMD             __at(0x16B6);	// @ (0x2D6 * 8 + 6)
#define                                 U3STPMD_bit         _BIT_ACCESS(U3FIFO,6)
// U3FIFO<U3TXBE>
extern volatile __bit                   U3TXBE              __at(0x16B5);	// @ (0x2D6 * 8 + 5)
#define                                 U3TXBE_bit          _BIT_ACCESS(U3FIFO,5)
// U3FIFO<U3TXBF>
extern volatile __bit                   U3TXBF              __at(0x16B4);	// @ (0x2D6 * 8 + 4)
#define                                 U3TXBF_bit          _BIT_ACCESS(U3FIFO,4)
// U3ERRIE<U3TXCIE>
extern volatile __bit                   U3TXCIE             __at(0x16C8);	// @ (0x2D9 * 8 + 0)
#define                                 U3TXCIE_bit         _BIT_ACCESS(U3ERRIE,0)
// U3ERRIR<U3TXCIF>
extern volatile __bit                   U3TXCIF             __at(0x16C0);	// @ (0x2D8 * 8 + 0)
#define                                 U3TXCIF_bit         _BIT_ACCESS(U3ERRIR,0)
// U3CON0<U3TXEN>
extern volatile __bit                   U3TXEN              __at(0x168D);	// @ (0x2D1 * 8 + 5)
#define                                 U3TXEN_bit          _BIT_ACCESS(U3CON0,5)
// PIE9<U3TXIE>
extern volatile __bit                   U3TXIE              __at(0x2539);	// @ (0x4A7 * 8 + 1)
#define                                 U3TXIE_bit          _BIT_ACCESS(PIE9,1)
// PIR9<U3TXIF>
extern volatile __bit                   U3TXIF              __at(0x25B9);	// @ (0x4B7 * 8 + 1)
#define                                 U3TXIF_bit          _BIT_ACCESS(PIR9,1)
// IPR9<U3TXIP>
extern volatile __bit                   U3TXIP              __at(0x1B59);	// @ (0x36B * 8 + 1)
#define                                 U3TXIP_bit          _BIT_ACCESS(IPR9,1)
// U3ERRIE<U3TXMTIE>
extern volatile __bit                   U3TXMTIE            __at(0x16CF);	// @ (0x2D9 * 8 + 7)
#define                                 U3TXMTIE_bit        _BIT_ACCESS(U3ERRIE,7)
// U3ERRIR<U3TXMTIF>
extern volatile __bit                   U3TXMTIF            __at(0x16C7);	// @ (0x2D8 * 8 + 7)
#define                                 U3TXMTIF_bit        _BIT_ACCESS(U3ERRIR,7)
// U3CON2<U3TXPOL>
extern volatile __bit                   U3TXPOL             __at(0x169A);	// @ (0x2D3 * 8 + 2)
#define                                 U3TXPOL_bit         _BIT_ACCESS(U3CON2,2)
// U3FIFO<U3TXWRE>
extern volatile __bit                   U3TXWRE             __at(0x16B7);	// @ (0x2D6 * 8 + 7)
#define                                 U3TXWRE_bit         _BIT_ACCESS(U3FIFO,7)
// U3CON1<U3WUE>
extern volatile __bit                   U3WUE               __at(0x1694);	// @ (0x2D2 * 8 + 4)
#define                                 U3WUE_bit           _BIT_ACCESS(U3CON1,4)
// U3UIR<U3WUIF>
extern volatile __bit                   U3WUIF              __at(0x16BF);	// @ (0x2D7 * 8 + 7)
#define                                 U3WUIF_bit          _BIT_ACCESS(U3UIR,7)
// U3FIFO<U3XON>
extern volatile __bit                   U3XON               __at(0x16B2);	// @ (0x2D6 * 8 + 2)
#define                                 U3XON_bit           _BIT_ACCESS(U3FIFO,2)
// U4CON0<U4ABDEN>
extern volatile __bit                   U4ABDEN             __at(0x1726);	// @ (0x2E4 * 8 + 6)
#define                                 U4ABDEN_bit         _BIT_ACCESS(U4CON0,6)
// U4UIR<U4ABDIE>
extern volatile __bit                   U4ABDIE             __at(0x1752);	// @ (0x2EA * 8 + 2)
#define                                 U4ABDIE_bit         _BIT_ACCESS(U4UIR,2)
// U4UIR<U4ABDIF>
extern volatile __bit                   U4ABDIF             __at(0x1756);	// @ (0x2EA * 8 + 6)
#define                                 U4ABDIF_bit         _BIT_ACCESS(U4UIR,6)
// U4ERRIE<U4ABDOVE>
extern volatile __bit                   U4ABDOVE            __at(0x1765);	// @ (0x2EC * 8 + 5)
#define                                 U4ABDOVE_bit        _BIT_ACCESS(U4ERRIE,5)
// U4ERRIR<U4ABDOVF>
extern volatile __bit                   U4ABDOVF            __at(0x175D);	// @ (0x2EB * 8 + 5)
#define                                 U4ABDOVF_bit        _BIT_ACCESS(U4ERRIR,5)
// U4CON0<U4BRGS>
extern volatile __bit                   U4BRGS              __at(0x1727);	// @ (0x2E4 * 8 + 7)
#define                                 U4BRGS_bit          _BIT_ACCESS(U4CON0,7)
// U4CON1<U4BRKOVR>
extern volatile __bit                   U4BRKOVR            __at(0x1729);	// @ (0x2E5 * 8 + 1)
#define                                 U4BRKOVR_bit        _BIT_ACCESS(U4CON1,1)
// U4ERRIE<U4CERIE>
extern volatile __bit                   U4CERIE             __at(0x1764);	// @ (0x2EC * 8 + 4)
#define                                 U4CERIE_bit         _BIT_ACCESS(U4ERRIE,4)
// U4ERRIR<U4CERIF>
extern volatile __bit                   U4CERIF             __at(0x175C);	// @ (0x2EB * 8 + 4)
#define                                 U4CERIF_bit         _BIT_ACCESS(U4ERRIR,4)
// U4CTSPPS<U4CTSPPS0>
extern volatile __bit                   U4CTSPPS0           __at(0x13C8);	// @ (0x279 * 8 + 0)
#define                                 U4CTSPPS0_bit       _BIT_ACCESS(U4CTSPPS,0)
// U4CTSPPS<U4CTSPPS1>
extern volatile __bit                   U4CTSPPS1           __at(0x13C9);	// @ (0x279 * 8 + 1)
#define                                 U4CTSPPS1_bit       _BIT_ACCESS(U4CTSPPS,1)
// U4CTSPPS<U4CTSPPS2>
extern volatile __bit                   U4CTSPPS2           __at(0x13CA);	// @ (0x279 * 8 + 2)
#define                                 U4CTSPPS2_bit       _BIT_ACCESS(U4CTSPPS,2)
// U4CTSPPS<U4CTSPPS3>
extern volatile __bit                   U4CTSPPS3           __at(0x13CB);	// @ (0x279 * 8 + 3)
#define                                 U4CTSPPS3_bit       _BIT_ACCESS(U4CTSPPS,3)
// U4CTSPPS<U4CTSPPS4>
extern volatile __bit                   U4CTSPPS4           __at(0x13CC);	// @ (0x279 * 8 + 4)
#define                                 U4CTSPPS4_bit       _BIT_ACCESS(U4CTSPPS,4)
// PIE12<U4EIE>
extern volatile __bit                   U4EIE               __at(0x2552);	// @ (0x4AA * 8 + 2)
#define                                 U4EIE_bit           _BIT_ACCESS(PIE12,2)
// PIR12<U4EIF>
extern volatile __bit                   U4EIF               __at(0x25D2);	// @ (0x4BA * 8 + 2)
#define                                 U4EIF_bit           _BIT_ACCESS(PIR12,2)
// IPR12<U4EIP>
extern volatile __bit                   U4EIP               __at(0x1B72);	// @ (0x36E * 8 + 2)
#define                                 U4EIP_bit           _BIT_ACCESS(IPR12,2)
// U4ERRIE<U4FERIE>
extern volatile __bit                   U4FERIE             __at(0x1763);	// @ (0x2EC * 8 + 3)
#define                                 U4FERIE_bit         _BIT_ACCESS(U4ERRIE,3)
// U4ERRIR<U4FERIF>
extern volatile __bit                   U4FERIF             __at(0x175B);	// @ (0x2EB * 8 + 3)
#define                                 U4FERIF_bit         _BIT_ACCESS(U4ERRIR,3)
// U4CON2<U4FLO0>
extern volatile __bit                   U4FLO0              __at(0x1730);	// @ (0x2E6 * 8 + 0)
#define                                 U4FLO0_bit          _BIT_ACCESS(U4CON2,0)
// U4CON2<U4FLO1>
extern volatile __bit                   U4FLO1              __at(0x1731);	// @ (0x2E6 * 8 + 1)
#define                                 U4FLO1_bit          _BIT_ACCESS(U4CON2,1)
// PIE12<U4IE>
extern volatile __bit                   U4IE                __at(0x2553);	// @ (0x4AA * 8 + 3)
#define                                 U4IE_bit            _BIT_ACCESS(PIE12,3)
// PIR12<U4IF>
extern volatile __bit                   U4IF                __at(0x25D3);	// @ (0x4BA * 8 + 3)
#define                                 U4IF_bit            _BIT_ACCESS(PIR12,3)
// IPR12<U4IP>
extern volatile __bit                   U4IP                __at(0x1B73);	// @ (0x36E * 8 + 3)
#define                                 U4IP_bit            _BIT_ACCESS(IPR12,3)
// PMD6<U4MD>
extern volatile __bit                   U4MD                __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 U4MD_bit            _BIT_ACCESS(PMD6,6)
// U4CON0<U4MODE0>
extern volatile __bit                   U4MODE0             __at(0x1720);	// @ (0x2E4 * 8 + 0)
#define                                 U4MODE0_bit         _BIT_ACCESS(U4CON0,0)
// U4CON0<U4MODE1>
extern volatile __bit                   U4MODE1             __at(0x1721);	// @ (0x2E4 * 8 + 1)
#define                                 U4MODE1_bit         _BIT_ACCESS(U4CON0,1)
// U4CON0<U4MODE2>
extern volatile __bit                   U4MODE2             __at(0x1722);	// @ (0x2E4 * 8 + 2)
#define                                 U4MODE2_bit         _BIT_ACCESS(U4CON0,2)
// U4CON1<U4ON>
extern volatile __bit                   U4ON                __at(0x172F);	// @ (0x2E5 * 8 + 7)
#define                                 U4ON_bit            _BIT_ACCESS(U4CON1,7)
// U4ERRIE<U4PERIE>
extern volatile __bit                   U4PERIE             __at(0x1766);	// @ (0x2EC * 8 + 6)
#define                                 U4PERIE_bit         _BIT_ACCESS(U4ERRIE,6)
// U4ERRIR<U4PERIF>
extern volatile __bit                   U4PERIF             __at(0x175E);	// @ (0x2EB * 8 + 6)
#define                                 U4PERIF_bit         _BIT_ACCESS(U4ERRIR,6)
// U4FIFO<U4RCIDL>
extern volatile __bit                   U4RCIDL             __at(0x174B);	// @ (0x2E9 * 8 + 3)
#define                                 U4RCIDL_bit         _BIT_ACCESS(U4FIFO,3)
// U4CON2<U4RUNOVF>
extern volatile __bit                   U4RUNOVF            __at(0x1737);	// @ (0x2E6 * 8 + 7)
#define                                 U4RUNOVF_bit        _BIT_ACCESS(U4CON2,7)
// U4FIFO<U4RXBE>
extern volatile __bit                   U4RXBE              __at(0x1749);	// @ (0x2E9 * 8 + 1)
#define                                 U4RXBE_bit          _BIT_ACCESS(U4FIFO,1)
// U4FIFO<U4RXBF>
extern volatile __bit                   U4RXBF              __at(0x1748);	// @ (0x2E9 * 8 + 0)
#define                                 U4RXBF_bit          _BIT_ACCESS(U4FIFO,0)
// U4CON1<U4RXBIMD>
extern volatile __bit                   U4RXBIMD            __at(0x172B);	// @ (0x2E5 * 8 + 3)
#define                                 U4RXBIMD_bit        _BIT_ACCESS(U4CON1,3)
// U4ERRIE<U4RXBKIE>
extern volatile __bit                   U4RXBKIE            __at(0x1762);	// @ (0x2EC * 8 + 2)
#define                                 U4RXBKIE_bit        _BIT_ACCESS(U4ERRIE,2)
// U4ERRIR<U4RXBKIF>
extern volatile __bit                   U4RXBKIF            __at(0x175A);	// @ (0x2EB * 8 + 2)
#define                                 U4RXBKIF_bit        _BIT_ACCESS(U4ERRIR,2)
// U4CON0<U4RXEN>
extern volatile __bit                   U4RXEN              __at(0x1724);	// @ (0x2E4 * 8 + 4)
#define                                 U4RXEN_bit          _BIT_ACCESS(U4CON0,4)
// U4ERRIE<U4RXFOIE>
extern volatile __bit                   U4RXFOIE            __at(0x1761);	// @ (0x2EC * 8 + 1)
#define                                 U4RXFOIE_bit        _BIT_ACCESS(U4ERRIE,1)
// U4ERRIR<U4RXFOIF>
extern volatile __bit                   U4RXFOIF            __at(0x1759);	// @ (0x2EB * 8 + 1)
#define                                 U4RXFOIF_bit        _BIT_ACCESS(U4ERRIR,1)
// U4FIFO<U4RXIDL>
extern volatile __bit                   U4RXIDL             __at(0x174B);	// @ (0x2E9 * 8 + 3)
#define                                 U4RXIDL_bit         _BIT_ACCESS(U4FIFO,3)
// PIE12<U4RXIE>
extern volatile __bit                   U4RXIE              __at(0x2550);	// @ (0x4AA * 8 + 0)
#define                                 U4RXIE_bit          _BIT_ACCESS(PIE12,0)
// PIR12<U4RXIF>
extern volatile __bit                   U4RXIF              __at(0x25D0);	// @ (0x4BA * 8 + 0)
#define                                 U4RXIF_bit          _BIT_ACCESS(PIR12,0)
// IPR12<U4RXIP>
extern volatile __bit                   U4RXIP              __at(0x1B70);	// @ (0x36E * 8 + 0)
#define                                 U4RXIP_bit          _BIT_ACCESS(IPR12,0)
// U4CON2<U4RXPOL>
extern volatile __bit                   U4RXPOL             __at(0x1736);	// @ (0x2E6 * 8 + 6)
#define                                 U4RXPOL_bit         _BIT_ACCESS(U4CON2,6)
// U4RXPPS<U4RXPPS0>
extern volatile __bit                   U4RXPPS0            __at(0x13C0);	// @ (0x278 * 8 + 0)
#define                                 U4RXPPS0_bit        _BIT_ACCESS(U4RXPPS,0)
// U4RXPPS<U4RXPPS1>
extern volatile __bit                   U4RXPPS1            __at(0x13C1);	// @ (0x278 * 8 + 1)
#define                                 U4RXPPS1_bit        _BIT_ACCESS(U4RXPPS,1)
// U4RXPPS<U4RXPPS2>
extern volatile __bit                   U4RXPPS2            __at(0x13C2);	// @ (0x278 * 8 + 2)
#define                                 U4RXPPS2_bit        _BIT_ACCESS(U4RXPPS,2)
// U4RXPPS<U4RXPPS3>
extern volatile __bit                   U4RXPPS3            __at(0x13C3);	// @ (0x278 * 8 + 3)
#define                                 U4RXPPS3_bit        _BIT_ACCESS(U4RXPPS,3)
// U4RXPPS<U4RXPPS4>
extern volatile __bit                   U4RXPPS4            __at(0x13C4);	// @ (0x278 * 8 + 4)
#define                                 U4RXPPS4_bit        _BIT_ACCESS(U4RXPPS,4)
// U4CON1<U4SENDB>
extern volatile __bit                   U4SENDB             __at(0x1728);	// @ (0x2E5 * 8 + 0)
#define                                 U4SENDB_bit         _BIT_ACCESS(U4CON1,0)
// U4CON2<U4STP0>
extern volatile __bit                   U4STP0              __at(0x1734);	// @ (0x2E6 * 8 + 4)
#define                                 U4STP0_bit          _BIT_ACCESS(U4CON2,4)
// U4CON2<U4STP1>
extern volatile __bit                   U4STP1              __at(0x1735);	// @ (0x2E6 * 8 + 5)
#define                                 U4STP1_bit          _BIT_ACCESS(U4CON2,5)
// U4FIFO<U4STPMD>
extern volatile __bit                   U4STPMD             __at(0x174E);	// @ (0x2E9 * 8 + 6)
#define                                 U4STPMD_bit         _BIT_ACCESS(U4FIFO,6)
// U4FIFO<U4TXBE>
extern volatile __bit                   U4TXBE              __at(0x174D);	// @ (0x2E9 * 8 + 5)
#define                                 U4TXBE_bit          _BIT_ACCESS(U4FIFO,5)
// U4FIFO<U4TXBF>
extern volatile __bit                   U4TXBF              __at(0x174C);	// @ (0x2E9 * 8 + 4)
#define                                 U4TXBF_bit          _BIT_ACCESS(U4FIFO,4)
// U4ERRIE<U4TXCIE>
extern volatile __bit                   U4TXCIE             __at(0x1760);	// @ (0x2EC * 8 + 0)
#define                                 U4TXCIE_bit         _BIT_ACCESS(U4ERRIE,0)
// U4ERRIR<U4TXCIF>
extern volatile __bit                   U4TXCIF             __at(0x1758);	// @ (0x2EB * 8 + 0)
#define                                 U4TXCIF_bit         _BIT_ACCESS(U4ERRIR,0)
// U4CON0<U4TXEN>
extern volatile __bit                   U4TXEN              __at(0x1725);	// @ (0x2E4 * 8 + 5)
#define                                 U4TXEN_bit          _BIT_ACCESS(U4CON0,5)
// PIE12<U4TXIE>
extern volatile __bit                   U4TXIE              __at(0x2551);	// @ (0x4AA * 8 + 1)
#define                                 U4TXIE_bit          _BIT_ACCESS(PIE12,1)
// PIR12<U4TXIF>
extern volatile __bit                   U4TXIF              __at(0x25D1);	// @ (0x4BA * 8 + 1)
#define                                 U4TXIF_bit          _BIT_ACCESS(PIR12,1)
// IPR12<U4TXIP>
extern volatile __bit                   U4TXIP              __at(0x1B71);	// @ (0x36E * 8 + 1)
#define                                 U4TXIP_bit          _BIT_ACCESS(IPR12,1)
// U4ERRIE<U4TXMTIE>
extern volatile __bit                   U4TXMTIE            __at(0x1767);	// @ (0x2EC * 8 + 7)
#define                                 U4TXMTIE_bit        _BIT_ACCESS(U4ERRIE,7)
// U4ERRIR<U4TXMTIF>
extern volatile __bit                   U4TXMTIF            __at(0x175F);	// @ (0x2EB * 8 + 7)
#define                                 U4TXMTIF_bit        _BIT_ACCESS(U4ERRIR,7)
// U4CON2<U4TXPOL>
extern volatile __bit                   U4TXPOL             __at(0x1732);	// @ (0x2E6 * 8 + 2)
#define                                 U4TXPOL_bit         _BIT_ACCESS(U4CON2,2)
// U4FIFO<U4TXWRE>
extern volatile __bit                   U4TXWRE             __at(0x174F);	// @ (0x2E9 * 8 + 7)
#define                                 U4TXWRE_bit         _BIT_ACCESS(U4FIFO,7)
// U4CON1<U4WUE>
extern volatile __bit                   U4WUE               __at(0x172C);	// @ (0x2E5 * 8 + 4)
#define                                 U4WUE_bit           _BIT_ACCESS(U4CON1,4)
// U4UIR<U4WUIF>
extern volatile __bit                   U4WUIF              __at(0x1757);	// @ (0x2EA * 8 + 7)
#define                                 U4WUIF_bit          _BIT_ACCESS(U4UIR,7)
// U4FIFO<U4XON>
extern volatile __bit                   U4XON               __at(0x174A);	// @ (0x2E9 * 8 + 2)
#define                                 U4XON_bit           _BIT_ACCESS(U4FIFO,2)
// U5CON0<U5ABDEN>
extern volatile __bit                   U5ABDEN             __at(0x17BE);	// @ (0x2F7 * 8 + 6)
#define                                 U5ABDEN_bit         _BIT_ACCESS(U5CON0,6)
// U5UIR<U5ABDIE>
extern volatile __bit                   U5ABDIE             __at(0x17EA);	// @ (0x2FD * 8 + 2)
#define                                 U5ABDIE_bit         _BIT_ACCESS(U5UIR,2)
// U5UIR<U5ABDIF>
extern volatile __bit                   U5ABDIF             __at(0x17EE);	// @ (0x2FD * 8 + 6)
#define                                 U5ABDIF_bit         _BIT_ACCESS(U5UIR,6)
// U5ERRIE<U5ABDOVE>
extern volatile __bit                   U5ABDOVE            __at(0x17FD);	// @ (0x2FF * 8 + 5)
#define                                 U5ABDOVE_bit        _BIT_ACCESS(U5ERRIE,5)
// U5ERRIR<U5ABDOVF>
extern volatile __bit                   U5ABDOVF            __at(0x17F5);	// @ (0x2FE * 8 + 5)
#define                                 U5ABDOVF_bit        _BIT_ACCESS(U5ERRIR,5)
// U5CON0<U5BRGS>
extern volatile __bit                   U5BRGS              __at(0x17BF);	// @ (0x2F7 * 8 + 7)
#define                                 U5BRGS_bit          _BIT_ACCESS(U5CON0,7)
// U5CON1<U5BRKOVR>
extern volatile __bit                   U5BRKOVR            __at(0x17C1);	// @ (0x2F8 * 8 + 1)
#define                                 U5BRKOVR_bit        _BIT_ACCESS(U5CON1,1)
// U5ERRIE<U5CERIE>
extern volatile __bit                   U5CERIE             __at(0x17FC);	// @ (0x2FF * 8 + 4)
#define                                 U5CERIE_bit         _BIT_ACCESS(U5ERRIE,4)
// U5ERRIR<U5CERIF>
extern volatile __bit                   U5CERIF             __at(0x17F4);	// @ (0x2FE * 8 + 4)
#define                                 U5CERIF_bit         _BIT_ACCESS(U5ERRIR,4)
// U5CTSPPS<U5CTSPPS0>
extern volatile __bit                   U5CTSPPS0           __at(0x13D8);	// @ (0x27B * 8 + 0)
#define                                 U5CTSPPS0_bit       _BIT_ACCESS(U5CTSPPS,0)
// U5CTSPPS<U5CTSPPS1>
extern volatile __bit                   U5CTSPPS1           __at(0x13D9);	// @ (0x27B * 8 + 1)
#define                                 U5CTSPPS1_bit       _BIT_ACCESS(U5CTSPPS,1)
// U5CTSPPS<U5CTSPPS2>
extern volatile __bit                   U5CTSPPS2           __at(0x13DA);	// @ (0x27B * 8 + 2)
#define                                 U5CTSPPS2_bit       _BIT_ACCESS(U5CTSPPS,2)
// U5CTSPPS<U5CTSPPS3>
extern volatile __bit                   U5CTSPPS3           __at(0x13DB);	// @ (0x27B * 8 + 3)
#define                                 U5CTSPPS3_bit       _BIT_ACCESS(U5CTSPPS,3)
// U5CTSPPS<U5CTSPPS4>
extern volatile __bit                   U5CTSPPS4           __at(0x13DC);	// @ (0x27B * 8 + 4)
#define                                 U5CTSPPS4_bit       _BIT_ACCESS(U5CTSPPS,4)
// U5CTSPPS<U5CTSPPS5>
extern volatile __bit                   U5CTSPPS5           __at(0x13DD);	// @ (0x27B * 8 + 5)
